Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ཉོན་མོངས་སྤོངས་པ་རློམ་སེམས་མི་དམིགས་ཏེ། །
en: Thus, having abandoned afflictions and being without pride,

source: ཤིན་ཏུ་སྒྲོམ་བུ་སྦས་པའི་སོས་གཟུགས་མི་རུང་བ། །
en: He can no longer be struck by the snake’s fangs.

source: དེ་ཡི་སྡིག་མཐོང་སེམས་ཅན་ཁྱད་པར་མེད་པ་ལྟར། །དེ་ལྟར་ཉོན་མོངས་པ་དག་སྤངས་ཤིང་འདས་པ་མེད། །
en: Though he perceives others’ evil, he is impartial toward all. He has abandoned afflictions, yet not transcended.

source: སྔོན་གྱི་ལས་མངོན་འདུ་བྱེད་སྡུག་བསྔལ་འཁོར་ལོ་སྡིག །གང་གིས་ཚེ་གཞན་དག་ཏུ་ཕྱིར་ཞིང་སྡུག་བསྔལ་བཟློག །
en: In the evil cycle of suffering produced by previous actions, He counteracts suffering for the sake of others.”

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Householder, this is how the Thus-Gone One correctly understands the faculties.

source: དེ་བཞིན་གཤེགས་པ་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the faculties,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྟོབས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the powers.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the powers and the lack of powers of sentient beings [so that he can tell,]

source: གང་ཟག་འདི་ནི་དད་པའི་སྟོབས་འདི་ཙམ་དང་ལྡན།
en: ‘This person has this much power of faith.

source: གང་ཟག་འདི་ནི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་འདི་ཙམ་དང་ལྡན།
en: This person has this much power of diligence.

source: དྲན་པའི་སྟོབས་འདི་ཙམ་དང་།
en: They have this much power of mindfulness.

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་འདི་ཙམ་དང་།
en: They have this much power of absorption.

source: གང་ཟག་འདི་ནི་ཤེས་རབ་ཀྱི་སྟོབས་འདི་ཙམ་དང་ལྡན།
en: This person has this much power of insight.

source: གང་ཟག་འདི་ནི་ཐབས་ལ་མཁས་པའི་སྟོབས་འདི་ཙམ་དང་ལྡན།
en: This person has this much power of skillful means.

source: གང་ཟག་འདི་ནི་མོས་པའི་སྟོབས་འདི་ཙམ་དང་ལྡན་ནོ། །
en: This person has this much power of devotion.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་སྟོབས་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, and so forth, up until . . . and be skillful about this is called knowing the powers .

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the powers,

source: འདིར་ཆོས་ཉིད་འདི་ལ་འདི་སྐད་ཅེས་བརྗོད་པར་བྱ་སྟེ།
en: At this point, with regard to this truth, I must state the following:

source: བདག་ཉིད་ཆེན་པོས་དུས་རིང་དག་ནས་སྟོབས་ཤེས་བསྟེན། །
en: “The great being has relied on knowing the powers for long.

source: སངས་རྒྱས་དཔག་མེད་དག་ལ་མ་ལུས་ཡོངས་སུ་ཞུས། །
en: He has requested this knowledge from limitless buddhas.

source: འཇིག་རྟེན་གསལ་མཛད་དབང་པོ་སྟོབས་དང་སྟོབས་མིན་གསུང་། །
en: The one who illuminates the world teaches The faculties, the powers, and the lack of powers.

source: སེམས་ཅན་ཀུན་གྱི་ཤེས་གང་མི་མཆོག་རབ་ཏུ་མཁྱེན། །
en: “The supreme human correctly understands the knowledge of all beings.

source: སེམས་ཅན་དག་གི་དད་བརྩོན་དྲན་ཤེས་ཤེས་རབ་མཁྱེན། །
en: He knows the faith, diligence, mindfulness, and insight of beings.

source: གང་ཞིག་ཆོས་འདི་ལ་འཇུག་འབྱོར་པ་ཅི་འདྲ་བ། །དེ་ཞུས་དེ་བཞིན་གཤེགས་པས་མཁྱེན་པས་ལུང་སྟོན་མཛད། །
en: Whoever wishes for this teaching, which is like a treasure, Should request it and the Thus-Gone One will teach with his knowledge.

source: རྫོགས་སངས་སྟོབས་ཤེས་དེ་ལ་ཡང་དང་ཡང་བསླབས་པས། །འདིར་ནི་ཞུས་ན་དེ་ཡིས་ཐོགས་མེད་ལུང་སྟོན་མཛད། །
en: “Since the perfect Buddha has trained repeatedly in knowledge of the powers, When requested he will teach about this without any hindrance.

source: རྣམ་འདྲེན་དེ་ནི་ཁང་མཆོག་འདི་ལ་ལོངས་སྤྱོད་འགྱུར།། །།
en: The Guide will enjoy this supreme building.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the power of diligence.

source: བརྩོན་འགྲུས་བརྩམས་པས་དོན་དག་འགྲུབ་ཅིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན།
en: He knows that practicing diligence accomplishes one’s aims; laziness does not.

source: བརྩོན་འགྲུས་དག་བརྩམས་པས་གནས་ཤེས་པ་རྟོགས་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན།
en: Practicing diligence makes one realize what is possible; laziness does not.

source: དེ་བཞིན་དུ་བརྩོན་འགྲུས་དག་བརྩམས་པས་གནས་ཤེས་པས་ཀུན་འབྱུང་བ་ཤེས་པ་རྟོགས་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན།
en: Likewise, practicing diligence makes one realize the knowledge of the origin as related to knowledge of what is possible; laziness does not.

source: བརྩོན་འགྲུས་དག་བརྩམས་པས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་རྟོགས་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན།
en: Practicing diligence makes one realize the knowledge of cessation as related to knowledge of what is possible; laziness does not.

source: བརྩོན་འགྲུས་དག་བརྩམས་པས་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་རྟོགས་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན།
en: Practicing diligence makes one realize the knowledge of the path that leads to cessation as related to knowledge of what is possible; laziness does not.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་སྟོབས་བཅུའི་བར་དག་ལ་ཡང་བྱའོ། །
en: Similarly, this applies to all ten powers.

source: བརྩོན་འགྲུས་དག་བརྩམས་པས་ཐམས་ཅད་མཁྱེན་པའི་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་རྟོགས་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན་ནོ། །
en: Practicing diligence makes one realize the knowledge of the path that leads to cessation as related to the knowledge of omniscience; laziness does not.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: About this he has said:

source: ལུས་དང་པགས་པ་རྒྱུས་པ་རུས་པ་སྐམས་གྱུར་ཅིང་། །བདག་གི་ལུས་དང་ཁྲག་བཅས་ཐམས་ཅད་ཡོངས་སྐམས་ཀྱང་། །
en: “ ‘The body, along with its skin, tendons, and bones will dry up.

source: ཐམས་ཅད་ཤེས་པ་རྟོགས་པར་མ་བྱས་པར་དུ་ནི། །བརྩོན་འགྲུས་གཏོང་བ་དག་ཏུ་བྱེད་པར་མི་འགྱུར་རོ། །
en: However, even though my body and its blood may dry up, I will not give up diligence Until I have realized omniscience.’

source: དེ་ལྟར་ན་བརྩོན་འགྲུས་བརྩམས་པས་གནས་ཤེས་པ་རྟོགས་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་མ་ཡིན་ཏེ།
en: “Practicing diligence makes one realize what is possible; laziness does not.

source: བརྩོན་འགྲུས་བརྩམས་པས་དོན་དག་བསྒྲུབ་པར་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན།
en: Practicing diligence accomplishes one’s aims; laziness does not.

source: ཐམས་ཅད་མཁྱེན་པའི་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པའི་བར་དུ་འགྱུར་ཞིང་། ལེ་ལོ་དག་གིས་ནི་མ་ཡིན་ནོ། །
en: And so forth, up until . . . the knowledge of the path that leads to cessation as related to the knowledge of omniscience; laziness does not.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands diligence.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of diligence,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རིམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the levels of diligence.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་རིམ་པས་ལུས་ཀྱི་དང་སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the various kinds of physical and mental diligence that arise due to the levels of diligence of all beings.

source: སེམས་ཅན་ཁ་ཅིག་ལུས་ཀྱི་བརྩོན་འགྲུས་དང་ལྡན་ལ། སེམས་ལས་བྱུང་བས་ནི་མ་ཡིན།
en: Some beings are physically diligent while they are not mentally diligent.

source: སེམས་ཅན་ཁ་ཅིག་སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་དང་ལྡན་ལ། ལུས་ཀྱིས་ནི་མ་ཡིན་ཏེ།
en: Other beings are mentally diligent while not physically diligent.

source: དེ་ལ་སེམས་ཅན་གང་དག་བརྩོན་འགྲུས་ཀྱི་ལུས་དང་ལྡན་ལ། སེམས་ལས་བྱུང་བས་ནི་མ་ཡིན་པ་དེ། ལུས་ཉམ་ཆུང་བ་ལས་སྨོད་པར་བྱེད།
en: Whoever has a diligent body but not a diligent mind is worse than those with weak physical diligence.

source: ལུས་ཉམ་ཆུང་བ་ལས་རྣམ་པར་བྱང་བ་མེད་པར་འཇིག་ཅིང་སྨོད་ལ་སྤྲོ་བ་མི་སྐྱེད་དོ། །
en: Compared to those with weak physical diligence, they break their training without having been purified, neglect themselves, and lack enthusiasm.

source: གང་དག་སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་དང་ལྡན་ལ། ལུས་ཀྱིས་ནི་མ་ཡིན་པ་དེ་ནི་སེམས་ཀྱི་དབང་གིས་སྨོད་པར་བྱེད་ཅིང་འཕྱར་བར་འགྱུར་རོ། །
en: Those who are mentally diligent but not physically so will first disregard themselves and then become inspired due to the power of mind.

source: གང་དག་ལུས་ཀྱི་དང་སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་དང་ལྡན་པ་དེ་དག་ནི། ཟུང་དུ་མཉམ་ཞིང་ལྡན་པ་ནི་སྨོད་པར་མི་བྱེད་ཅིང་འཕྱར་པར་མི་བྱེད་ལ།
en: Whoever is diligent in both body and mind is well balanced and therefore neither neglects nor intensifies their efforts.

source: བརྩོན་འགྲུས་བར་མའི་ཤེས་པ་དང་ལྡན་པས་ཚོགས་སྒྲུབ་ཅིང་བྱ་བ་མཐར་བྱེད་ལ། བྱ་བ་ཡང་དག་པར་སྒྲུབ།
en: With the cognition of such a balanced diligence they accomplish the accumulations, complete their activities, accomplish their activities,

source: བདུད་ཀྱི་ཞགས་པ་གཅོད།
en: break the chains of the demons,

source: བདུད་ཕམ་པར་བྱེད།
en: defeat the demons,

source: བདུད་ཕྱིར་ཕྱོགས་པར་བྱེད།
en: drive away the demons,

source: བདུད་ཀྱི་རིས་དག་སྐྲག་པར་བྱེད།
en: terrify all classes of demons,

source: སངས་རྒྱས་ཀྱི་རྒྱུད་འཕེལ་བར་བྱེད།
en: increase the lineage of the Buddha,

source: ལམ་སྤྱོད་པར་བྱེད།
en: train on the path,

source: མུ་བསྟེན་པར་བྱེད།
en: attend on the border,

source: ཟམ་པ་འདོགས་པར་བྱེད།
en: suspend bridges,

source: སྟེགས་འཆའ་བར་བྱེད།
en: construct dams,

source: ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་འབར་བར་བྱེད།
en: light the torch of wisdom,

source: སྣང་བར་བྱེད། མུན་པ་སེལ་བར་བྱེད།
en: shine light, clear away darkness,

source: ལམ་སྟོན་པར་བྱེད།
en: show the path,

source: ཡང་དག་པར་བླང་བའི་བརྩོན་འགྲུས་ལ་ཤིན་ཏུ་གནས་ཤིང་ཡོངས་སུ་མི་ཉམས་པར་བྱེད་དོ། །
en: abide firmly in determined diligence, and ensure that it does not degenerate.

source: གང་དག་ལུས་ཀྱིའམ། སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་དེ་དག་ནི། ཤིང་ཀ་ཏ་ཀའི་འབྲས་བུ་ལྟར་དེ་དག་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ། །
en: Whoever has diligence that only arises from the body or the mind will spoil like the fruit of the clearing nut tree.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་རིམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands the levels of diligence.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཀྱི་རིམ་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the levels of diligence,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of concentration.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཉམས་པའི་ཆ་དང་འཐུན་པའི་བསམ་གཏན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: [Householder,] He correctly understands the concentration that is conducive to regression.

source: གནས་པའི་ཆ་དང་འཐུན་པའི་བསམ་གཏན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the concentration that is conducive to abiding.

source: ཁྱད་པར་གྱི་ཆ་དང་འཐུན་པའི་བསམ་གཏན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the concentration that is conducive to enhancement.

source: ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའི་བསམ་གཏན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands the concentration that is conducive to penetration.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands concentration.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཡོངས་སུ་ཉམས་པའི་བསམ་གཏན་དེ་དག་གི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that lead to the regressive concentrations.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་གནས་པའི་ཆ་དང་འཐུན་པར་གྱུར་པ་དེ་དག་གི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands those causes and conditions that lead to the concentrations that are conducive to abiding.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཁྱད་པར་གྱི་ཆ་དང་འཐུན་པར་གྱུར་པའི་བསམ་གཏན་དེ་དག་གི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands those causes and conditions that lead to the concentrations that are conducive to enhancement.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པར་གྱུར་བའི་བསམ་གཏན་དེ་དག་གི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: He correctly understands those causes and conditions that lead to the concentrations that are conducive to penetration.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands concentration.

source: དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of concentration,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་ཐར་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of liberation.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་ཐར་པ་བརྒྱད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the eight liberations.

source: བརྒྱད་གང་ཞེ་ན།
en: What are these eight?

source: གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་དང་པོའོ། །
en: The first liberation is that of the one with form observing forms.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་གཉིས་པའོ། །
en: The second liberation is that of observing outer forms with the notion that the inner being is formless.

source: གཙང་བ་ཉིད་ལ་མོས་པ་འདི་ནི་རྣམ་པར་ཐར་བ་གསུམ་པ་ཡིན་ནོ། །
en: The third liberation is interest in purity.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་རྣམ་པར་ཐར་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་རྣམ་པར་ཐར་པ་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་རྣམ་པར་ཐར་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་རྣམ་པར་ཐར་པ་དང་། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་རྣམ་པར་ཐར་པ་བརྒྱད་པ་སྟེ།
en: The fourth to the eighth liberations are the liberation of resting in equanimity in the sphere of limitless space, the liberation of resting in equanimity in the sphere of limitless consciousness, the liberation of resting in equanimity in the sphere of nothing whatsoever, the liberation of resting in equanimity in the sphere of neither notion nor no notion, and the liberation of the cessation of notions and feelings.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཐར་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of liberation,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of absorption.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the four absorptions.

source: ཤུགས་ལྡན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེང་གེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཞི་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུན་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏེ།
en: They are the absorptions called ‘the powerful,’ ‘the lion,’ ‘peace,’ and ‘endowed with the continuity of all phenomena.’

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In that way the Thus-Gone One correctly understands absorption.

source: དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of absorption,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of equilibrium.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་ལ་མངོན་པར་གནས་པ་དང་། དོན་རྟོགས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands how to abide in concentration and realize the meaning.

source: གང་དག་བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས། ཟག་པ་ཟད་ཅིང་དོན་རྟོགས་པའི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས་མི་རྟག་པ་ཡིད་ལ་བྱེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས་སྡུག་བསྔལ་ཡིད་ལ་བྱེད་པའི་སྙོམས་པར་འཇུག་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཕྱིར་རྒོལ་བ་ཡིད་ལ་བྱེད་པའི་བར་གྱི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས། མཚན་མ་དང་བྲལ་བའི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས། བདག་མེད་པ་དང་བྲལ་བའི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས་སྨོན་ལམ་དང་བྲལ་བའི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས། རྒྱུན་ཏུ་འཇུག་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་པོ་ལ་བརྟེན་ནས། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་བར་ལ་སྙོམས་པར་འཇུག་པ་སྟེ།
en: This applies to the equilibrium of exhausting defilements and realizing the meaning based on the first concentration, the equilibrium of analyzing impermanence based on the first concentration, the equilibrium of analyzing suffering, and so on, up to . . . the equilibrium of analyzing opposition based on the first concentration, the equilibrium of the absence of marks based on the first concentration, the equilibrium of the absence of selflessness based on the first concentration, the equilibrium of the absence of aspirations based on the first concentration, the equilibrium of actualizing the result of a stream-enterer based on the first concentration, and the equilibrium of actualizing the result of a worthy one based on the first concentration.

source: དེ་བཞིན་དུ་བསམ་གཏན་གཉིས་པ་ལ་བརྟེན་པ་ནས། བསམ་གཏན་བཞི་པ་ལ་བརྟེན་པ་དང་། འདུ་ཤེས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པའི་བར་ལ་ཡང་རྒྱ་ཆེར་བྱ་སྟེ
en: Likewise, this applies to relying on the second to the fourth concentration, the equilibrium of no notion, the equilibrium within the sphere of limitless space, the equilibrium within the sphere of limitless consciousness, the equilibrium within the sphere of nothing whatsoever, the equilibrium within the sphere of neither notion nor no notion, and the equilibrium within the sphere of the cessation of notions and feelings.

source: དེ་བཞིན་གཤེགས་པ་སྙོམས་པར་འཇུག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of equilibrium,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of affliction.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: Householder, the Thus-Gone One correctly understands how desire causes affliction.

source: འདོད་ཆགས་དང་ཞེ་སྡང་གིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how desire and anger cause affliction.

source: འདོད་ཆགས་དང་གཏི་མུག་གིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how desire and delusion cause affliction.

source: ཞེ་སྡང་དང་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how anger and desire cause affliction.

source: ཞེ་སྡང་དང་གཏི་མུག་གིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how anger and delusion cause affliction.

source: གཏི་མུག་དང་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how delusion and desire cause affliction.

source: ཆ་མཉམ་པས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how an even blend of these emotions causes affliction.

source: ཁྲོ་བས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how wrath causes affliction.

source: ཁོན་དང་ཡོངས་སུ་གདུང་བ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་དང་། གཡོ་དང་། སྒྱུ་དང་། ངོ་ཚ་མེད་པ་དང་། ཁྲེལ་མེད་པ་དང་། ཁེངས་པ་དང་། ཉེས་རྩོམ་དང་། རྒྱགས་པ་དང་། བག་མེད་པ་དང་། ང་རྒྱལ་ལས་ཀྱང་ལྷག་པའི་ང་རྒྱལ་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how affliction is brought on by enmity, grief, jealousy, stinginess, deceit, trickery, shamelessness, inconsideration, haughtiness, conceit, arrogance, audaciousness, pride, and so forth, up to manifest pride.

source: ཅུང་ཟད་སྙམ་པའི་ང་རྒྱལ་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how inverse pride causes affliction.

source: ཁ་གསག་དང་། གཞོགས་སློང་དང་། ཐོབ་ཀྱིས་འཇལ་བས་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands how trickery, cunning, and extortion cause affliction.

source: རྙེད་པས་རྙེད་པར་བྱེད་འདོད་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། སྡིག་འདོད་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། འདོད་ཆེན་དང་། འདོད་པ་དང་། དྲན་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། སྤྱོད་པ་མ་ཡིན་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། མི་སྙན་པར་སྨྲ་བ་ཉིད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། མི་བཟོད་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། སྦེད་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཡོངས་སུ་སྦེད་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཆགས་པ་དང་མི་འཐུན་པར་ཆགས་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། འཇིག་ཚོགས་ལ་ལྟ་བས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཐེ་ཙོམ་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། འདོད་པ་ལ་འདུན་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། གནོད་སེམས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྨུགས་པ་དང་གཉིད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྒོད་པ་དང་། འགྱོད་པ་དང་། ཡིད་གཉིས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། མི་དགའ་བས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། དགའ་བས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། གླལ་བས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། བཟའ་བ་མ་བསྡམས་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། སེམས་ལས་བྱུང་བ་ཀུན་ནས་ཉོན་མོངས་པ་དང་། སེམས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། འདུ་ཤེས་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། བདག་ལ་དབང་མེད་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ལུས་ཀྱི་གནས་ངན་ལེན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཐོགས་པས་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཆོག་མི་ཤེས་པས་ཀུན་ནས་ཉོན་མོངས་པ་སྟེ།
en: [He correctly understands how] affliction is caused by seeking profit, seeking the unwholesome, lust, desire, longing, improper behavior, speaking harshly, impatience, hiding, concealing, improper desire, attachment and improper attachment, viewing the transitory collection, doubt, considering discipline and ritual to be supreme, chasing desire, ill will, lethargy and sloth, agitation, regret, doubt, sadness, happiness, sleepiness, overeating, mental factors, thinking, various notions, lack of independence, the unwholesome physical states, obstruction, and dissatisfaction.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, that is how the Thus-Gone One correctly understands affliction.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of affliction,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་བྱང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of purification.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འདོད་པ་ལ་འདུན་པའི་གཉེན་པོ་ནི་མི་གཙང་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: Householder, the Thus-Gone One correctly understands that impurity is the antidote to sensual desire.

source: གནོད་སེམས་ཀྱི་གཉེན་པོ་ནི་བྱམས་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that love is the antidote to ill will.

source: རྨུགས་པ་དང་གཉིད་ཀྱི་གཉེན་པོ་ནི་བརྩོན་འགྲུས་རྩོམ་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that the practice of diligence is the antidote to lethargy and sloth.

source: རྒོད་པའི་གཉེན་པོ་ནི་ཞི་གནས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that tranquility is the antidote to agitation.
